

-- WA campaign for new 13 branches + 3 branches
SELECT 	concat('856', right(customer_tel, length(customer_tel) - 2)) 'WHATSAPP',
CONCAT('*ສະບາຍດີ, ລູກຄ້າທີ່ຮັກແພງ. ພວກເຮົາມີຂ່າວດີແຈ້ງໃຫ້ທ່ານຊາບ.*
ປະຈຸບັນນີ້ ບໍລິສັດ LALCO ຂອງພວກເຮົາໄດ້ຂະຫຍາຍສາຂາໃໝ່ 16 ສາຂາ ເພື່ອໃຫ້ໃກ້ບ້ານທ່ານ ໃຫ້ສາມາດບໍລິການລູກຄ້າໃຫ້ຄວບຄຸມແລະທົ່ວເຖິງໃນຂອບເຂດທົ່ວປະເທດ.

*ທ່ານເປັນຄົນໜຶ່ງທີ່ໂຊກດີຫຼາຍ ເມື່ອທ່ານໄດ້ຮັບຂໍ້ຄວາມນີ້.*
ພວກເຮົາ LALCO ເປີດໂອກາດໃຫ້ທ່ານສາມາດເຂົ້າຮ່ວມເປັນຄອບຄົວດຽວກັນກັບພວກເຮົາ ແລະ ໄດ້ຮັບຜົນປະໂຫຍດດັ່ງຕໍ່ໄປນີ້:
*(1)* ຖ້າທ່ານສົນໃຈເປັນ *[ ນາຍໜ້າ ]:* ເມື່ອທ່ານແນະນຳ ລູກຄ້າມາໃຫ້ພວກເຮົາ ທ່ານຈະໄດ້ຮັບເງິນໄປເລີຍ 3.5% ຂອງດອກເບ້ຍທັງໝົດ 
*ຕົວຢ່າງ:* ວົງເງິນກູ້ *10,000$* ທ່ານໄດ້ຮັບໄປເລີຍ *315$* ລາຍລະອຽດສາມາດສອບຖາມໄດ້ ສາຂາໃກ້ບ້ານທ່ານ ຫຼື ໂທປຶກສາຫົວໜ້າສາຂາໄດ້
*(2)* ຖ້າທ່ານສົນໃຈເປັນ *[ ລູກຄ້າ ]:* ທ່ານຈະໄດ້ເງິນໄປໃຊ້ຈ່າຍທັນທີ ແລະ ວົງເງິນບໍ່ຈຳກັັດອີກ ບໍລິການວ່ອງໄວ ແລະ ເຖິງທີ່, ເມື່ອທ່ານປຶກສາເງິນກູ້ກັບພວກເຮົາ
*(3)* ພວກເຮົາຍັງ *ເປີດຮັບພະນັກງານ* ການຕະຫຼາດຈຳນວນຫຼາຍ ທ່ານສາມາດ ແນະນຳຄົນຮູ້ຈັກ ຫຼື ພີ່ນ້ອງຂອງທ່ານ ເຂົ້າມາຍື່ນ CV ສາຂາໃກ້ບ້ານທ່ານໄດ້ ໃນໂມງການ

>> ສົນໃຈເປັນນາຍໜ້າ ຕອບ 1
>> ສົນໃຈຢາກກູ້ຢືມເງິນ ຕອບ 2
>> ສົນໃຈຢາກສະໝັກວຽກ ຕອບ 3

',
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໄຊທານີ (ນະຄອນຫຼວງ) (CAT : 020 54151519)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຫາດຊາຍຟອງ (ນະຄອນຫຼວງ) (KONG : 020 96295038)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ນາຊາຍທອງ (ນະຄອນຫຼວງ) (NY : 020 96737360)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືືອງ ປາກງື່ມ (ນະຄອນຫຼວງ) (FON-F : 020 77335449)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ນ້ຳບາກ (ແຂວງ ຫຼວງພະບາງ) (VATH : 020 94222206)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ປາກລາຍ (ແຂວງ ໄຊຍະບູລີ) (NOY-M : 020 97700889)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຄຳ (ແຂວງ ຊຽງຂວາງ) (PHUN : 020 59685564)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ໄຊສົມບູນ  (THA : 020 91559255)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ຜົ້ງສາລີ  (VANG : 020 91819635)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ສອງຄອນ (ແຂວງ ຈຳປາສັກ) (PINMANY : 020 92341779)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ວັງວຽງ (ແຂວງ ວຽງຈັນ) (HONG : 020 78163998)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຄຳເກີດ (ແຂວງ ບໍລິຄຳໄຊ) (LEE : 020 97299574)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ປາກຊອງ (ແຂວງ ຈຳປາສັກ) (KHAM : 020 54177087)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໂພນທອງ (ແຂວງ ຈຳປາສັກ) (PUNA : 020 99848359)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເຊກອງ  (LEY : 020 52222214)'
 '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໄຊເສດຖາ (ແຂວງ ອັດຕະປື) (LEUA : 020 54921285)'
) 'BODY' 
FROM tabSME_Approach_list tsal 
WHERE branch_name = 
-- 'Nam Bak - Luangprabang'
-- 'Sekong'
-- 'Parkngum - Vientiane Capital'
-- 'Hadxayfong - Vientiane Capital'
-- 'Naxaythong - Vientiane Capital'
-- 'Xaisomboun'
-- 'Vangvieng - Vientiane Province'
-- 'Xaythany - Vientiane Capital'
-- 'Kham - Xiengkhuang'
-- 'Phongsary'
-- 'Parklai - Xayaboury'
 'Saysetha - Attapeu'
-- 'Paksong - Champasack'
-- 'Khamkeut - Borikhamxay'
-- 'Songkhone - Savanakhet'
-- 'Phonthong - Champasack'--- ສົ່ງຂໍ້ຄວາມ ຫາ ເບີໂທໝ່ ຂອງ 13 ສາຂາໃໝ່



SELECT 	concat('856', right(customer_tel, length(customer_tel) - 2)) 'WHATSAPP',
CONCAT('*ສະບາຍດີ, ລູກຄ້າທີ່ຮັກແພງ. ພວກເຮົາມີຂ່າວດີແຈ້ງໃຫ້ທ່ານຊາບ.*
ປະຈຸບັນນີ້ ບໍລິສັດ LALCO ຂອງພວກເຮົາໄດ້ຂະຫຍາຍສາຂາໃໝ່ 16 ສາຂາ ເພື່ອໃຫ້ໃກ້ບ້ານທ່ານ ໃຫ້ສາມາດບໍລິການລູກຄ້າໃຫ້ຄວບຄຸມແລະທົ່ວເຖິງໃນຂອບເຂດທົ່ວປະເທດ.

*ທ່ານເປັນຄົນໜຶ່ງທີ່ໂຊກດີຫຼາຍ ເມື່ອທ່ານໄດ້ຮັບຂໍ້ຄວາມນີ້.*
ພວກເຮົາ LALCO ເປີດໂອກາດໃຫ້ທ່ານສາມາດເຂົ້າຮ່ວມເປັນຄອບຄົວດຽວກັນກັບພວກເຮົາ ແລະ ໄດ້ຮັບຜົນປະໂຫຍດດັ່ງຕໍ່ໄປນີ້:
*(1)* ຖ້າທ່ານສົນໃຈເປັນ *[ ນາຍໜ້າ ]:* ເມື່ອທ່ານແນະນຳ ລູກຄ້າມາໃຫ້ພວກເຮົາ ທ່ານຈະໄດ້ຮັບເງິນໄປເລີຍ 3.5% ຂອງດອກເບ້ຍທັງໝົດ 
*ຕົວຢ່າງ:* ວົງເງິນກູ້ *10,000$* ທ່ານໄດ້ຮັບໄປເລີຍ *315$* ລາຍລະອຽດສາມາດສອບຖາມໄດ້ ສາຂາໃກ້ບ້ານທ່ານ ຫຼື ໂທປຶກສາຫົວໜ້າສາຂາໄດ້
*(2)* ຖ້າທ່ານສົນໃຈເປັນ *[ ລູກຄ້າ ]:* ທ່ານຈະໄດ້ເງິນໄປໃຊ້ຈ່າຍທັນທີ ແລະ ວົງເງິນບໍ່ຈຳກັັດອີກ ບໍລິການວ່ອງໄວ ແລະ ເຖິງທີ່, ເມື່ອທ່ານປຶກສາເງິນກູ້ກັບພວກເຮົາ
*(3)* ພວກເຮົາຍັງ *ເປີດຮັບພະນັກງານ* ການຕະຫຼາດຈຳນວນຫຼາຍ ທ່ານສາມາດ ແນະນຳຄົນຮູ້ຈັກ ຫຼື ພີ່ນ້ອງຂອງທ່ານ ເຂົ້າມາຍື່ນ CV ສາຂາໃກ້ບ້ານທ່ານໄດ້ ໃນໂມງການ

>> ສົນໃຈເປັນນາຍໜ້າ ຕອບ 1
>> ສົນໃຈຢາກກູ້ຢືມເງິນ ຕອບ 2
>> ສົນໃຈຢາກສະໝັກວຽກ ຕອບ 3

',
 '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໄຊທານີ (ນະຄອນຫຼວງ) (CAT : 020 54151519)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຫາດຊາຍຟອງ (ນະຄອນຫຼວງ) (KONG : 020 96295038)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ນາຊາຍທອງ (ນະຄອນຫຼວງ) (NY : 020 96737360)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືືອງ ປາກງື່ມ (ນະຄອນຫຼວງ) (FON-F : 020 77335449)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ນ້ຳບາກ (ແຂວງ ຫຼວງພະບາງ) (VATH : 020 94222206)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ປາກລາຍ (ແຂວງ ໄຊຍະບູລີ) (NOY-M : 020 97700889)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຄຳ (ແຂວງ ຊຽງຂວາງ) (PHUN : 020 59685564)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ໄຊສົມບູນ  (THA : 020 91559255)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ຜົ້ງສາລີ  (VANG : 020 91819635)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ສອງຄອນ (ແຂວງ ຈຳປາສັກ) (PINMANY : 020 92341779)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ວັງວຽງ (ແຂວງ ວຽງຈັນ) (HONG : 020 78163998)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຄຳເກີດ (ແຂວງ ບໍລິຄຳໄຊ) (LEE : 020 97299574)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ປາກຊອງ (ແຂວງ ຈຳປາສັກ) (KHAM : 020 54177087)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໂພນທອງ (ແຂວງ ຈຳປາສັກ) (PUNA : 020 99848359)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເຊກອງ  (LEY : 020 52222214)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໄຊເສດຖາ (ແຂວງ ອັດຕະປື) (LEUA : 020 54921285)'
) 'BODY' 
FROM tabSME_Approach_list tsal 
WHERE approach_type = 'Approach list'
	and branch_name = 
-- 'Nam Bak - Luangprabang'
-- 'Sekong'
-- 'Parkngum - Vientiane Capital'
-- 'Hadxayfong - Vientiane Capital'
-- 'Naxaythong - Vientiane Capital'
-- 'Xaisomboun'
-- 'Vangvieng - Vientiane Province'
 'Xaythany - Vientiane Capital'
-- 'Kham - Xiengkhuang'
-- 'Phongsary'
-- 'Parklai - Xayaboury'
-- 'Saysetha - Attapeu'
-- 'Paksong - Champasack'
-- 'Khamkeut - Borikhamxay'
-- 'Songkhone - Savanakhet'
-- 'Phonthong - Champasack'--- ສົ່ງຂໍ້ຄວາມ ຫາ ເບີໂທໝ່ ຂອງ 13 ສາຂາໃໝ່
;





-- WA campaign for Past SABC over 1 year for IT team
SELECT 
    CONCAT('856', SUBSTRING(bp.customer_tel, 2)) AS `WHATSAPP`,
    'ສະບາຍດີ,
ຂໍໂທດທີ່ລົບກວນ!

ຂ້ອຍຊື່ ຄຳ, ເປັນພະນັກງານ ຂອງບໍລິສັດ LALCO, ເຊິ່ງເປັນບໍລິສັດຊັ້ນນໍາທີ່ສະເຫນີການແກ້ໄຂທາງດ້ານການເງິນທີ່ຍືດຫຍຸ່ນເພື່ອຕອບສະຫນອງຄວາມຕ້ອງການຂອງທຸກທ່ານ. ພວກເຮົາໃຫ້ທາງເລືອກປ່ອຍສິນເຊື່ອໂດຍບໍ່ຈຳກັດຈຳນວນເງິນກູ້ຢືມ, ເຮັດໃຫ້ມັນງ່າຍສໍາລັບທ່ານທີ່ຈະສະໜອງທຶນໃຫ້ກັບໂຄງການ ຫຼື ທຸລະກິດຂອງທ່ານ.

ນີ້ແມ່ນບາງຜົນປະໂຫຍດທີ່ສໍາຄັນໃນການບໍລິການຂອງພວກເຮົາ:
- ອັດຕາດອກເບ້ຍເລີ່ມຕົ້ນຕໍ່າສຸດ 1.29% ແລະສູງສຸດ 3% ຕໍ່ເດືອນ.
- ໄລຍະເວລາການກູ້ຢືມມີຕັ້ງແຕ່ 3 ຫາ 36 ເດືອນ, ເຫມາະສົມກັບຄວາມສະດວກສະບາຍຂອງທ່ານ.
ຖ້າຫາກທ່ານມີຄວາມສົນໃຈ ຢາກຮັບຮູ້ຂໍ້ມູນເພີ່ມເຕີມ ຫຼືມີຄໍາຖາມໃດໆ, ກະລຸນາຕິດຕໍ່ຫາໄດ້. ພວກເຮົາຢູ່ທີ່ນີ້ເພື່ອຊ່ວຍໃຫ້ທ່ານຕັດສິນໃຈທາງດ້ານການເງິນທີ່ດີທີ່ສຸດສໍາລັບທຸລະກິດ ຫຼືຄວາມຕ້ອງການສ່ວນບຸກຄົນຂອງທ່ານ.

ລໍຖ້າໃຫ້ການຊ່ວຍເຫຼືອທ່ານ!
ດ້ວຍຄວາມນັບຖືຢ່າງສູງ
ຄຳ ເບີໂທ 020 2930 1330' AS `BODY`, 
    tb.id AS `custom_id`
FROM 
    tabSME_BO_and_Plan AS bp
JOIN 
    temp_sme_pbx_BO AS tb ON bp.name = tb.id
WHERE 
    tb.type IN ('S', 'A', 'B', 'C') 
    AND tb.month_type > 12
LIMIT 2;




-- WA to Non-sales 5way 5 relationships
SELECT 
    CONCAT('856', RIGHT(broker_tel , LENGTH(broker_tel) - 2)) AS 'WHATSAPP',
    CONCAT('ສະບາຍດີ, ທ່ານລູກຄ້າ ',RIGHT(broker_tel , LENGTH(broker_tel) - 2),' ທີ່ຮັກແພງ!',
'
ຈາກ ຄຳ (ບໍລິສັດ ລາວອາຊຽນ ເຊົ່າສິນເຊື່ອ ມະຫາຊົນ) ເດີ,
ຊ່ວງນີ້ ອ້າຍ ເອື້ອຍນ້ອງ ເຮົາ ບໍຮູ້ຈັກຄົນຢາກໄດ້ເງິນທຶນໄປໝູນວຽນ ແດ່ບໍເຈົ້າ.
ເພາະ ທາງບໍລິສັດ ມີນະໂຍບາຍ ແລະ ເປົ້າໝາຍໃຫ້ຊອກລູກຄ້າໃໝ່ ພ້ອມກັບເງຶ່ອນໄຂ ພິເສດ ຄື
- ຮັບປິດງວດ ຢູ່ບໍລິສັດອື່ນ ດອກເບັ້ຍພຽງແຕ່ 1.29% ສຳລັບໄລຍະຍາວ ແລະ 1.99% ສຳລັບໄລຍະສັ້ນ
- ຫຼື ຖ້າເປັນລູກຄ້າເກົ່າ ທີ່ເຄີຍກູ້ຢືມຈາກ ບໍລິສັດແລ້ວ, ຈະຫຼຸດດອກເບັ້ຍໃຫ້ຄື ໄລຍະສັ້ນ ແມ່ນ 2.5% ແລະ ຈະຫຼຸດດອກເບັ້ຍຈົນເຖິງ 1.99% ສຳລັບໄລຍະຍາວ*
- ສຳລັບ ຄ່ານາຍໜ້າ ແມ່ນ ໃຫ້ 3.5% ຂອງດອກເບັ້ຍທັງໝົດ, ຖ້າແນະນຳລາຍທີ 2 ແມ່ນ ບວກເພີ່ມ $50
-----------------------
☎ ສອບຖາມລາຍລະອຽດ ຄຳ ໂທ ຫຼືື WhatsApp: 020 99222886
') AS 'BODY',
	concat(current_staff,'_',name) AS 'custom_id'
FROM tabsme_Sales_partner
WHERE current_staff like '1003 - %' AND broker_type = '5way - 5ສາຍພົວພັນ'
	and sp.`rank` != 'Block - ຕ້ອງການໃຫ້ບຼ໋ອກ'
-- limit 10;





-- WA to Non-sales 5way 5 relationships
SELECT 
    CONCAT('856', RIGHT(broker_tel , LENGTH(broker_tel) - 2)) AS 'WHATSAPP',
    CONCAT('ສະບາຍດີ, ເອື້ອຍອ້າຍ ',RIGHT(broker_tel , LENGTH(broker_tel) - 2),' ທີ່ຮັກແພງ!',
'
 ຂໍລົບກວນເວລານ້ອຍໜຶ່ງເເດ່ເດີ.

ເຮົາເປັນພະນັກງານບໍລິສັດລາວອາຊຽນເຊົ່າສິນເຊື່ອ ເດີ, ຢາກຈະທາບທາມຖາມຂ່າວຫາ ອ້າຍເອື້ອຍນ້ອງທຸກຄົນ, ຊ່ວງນີ້ວຽກງານການເງິນເປັນຈັ່ງໃດ, ຫາກມີຫຍັງຢາກໃຫ້ເຮົາຊ່ວຍແມ່ນສາມາດປຶກສາໄດ້ເດີເຈົ້າ.

ແລະ ເຮົາກະມີແນວຢາກໃຫ້ທາງອ້າຍເອື້ອຍຊ່ວຍຄືກັນ ພໍດີຊ່ວງນີ້ ທາງບໍລິສັດ ມີນະໂຍບາຍ ແລະ ເປົ້າໝາຍໃຫ້ຊອກລູກຄ້າໃໝ່ ພ້ອມກັບເງຶ່ອນໄຂ ພິເສດ ຄື 
- ຮັບປິດງວດ ຢູ່ບໍລິສັດອື່ນ ດອກເບັ້ຍພຽງແຕ່ 1.29% ສຳລັບໄລຍະຍາວ ແລະ 1.99% ສຳລັບໄລຍະສັ້ນ
- ຫຼື ຖ້າເປັນລູກຄ້າເກົ່າ ທີ່ເຄີຍກູ້ຢືມຈາກ ບໍລິສັດແລ້ວ, ຈະຫຼຸດດອກເບັ້ຍໃຫ້ຄື ໄລຍະສັ້ນ ແມ່ນ 2.5% ແລະ ຈະຫຼຸດດອກເບັ້ຍຈົນເຖິງ 1.99% ສຳລັບໄລຍະຍາວ*
- ສຳລັບ ຄ່ານາຍໜ້າ ແມ່ນ ໃຫ້ 3.5% ຂອງດອກເບັ້ຍທັງໝົດ, ຖ້າແນະນຳລາຍທີ 2 ແມ່ນ ບວກເພີ່ມ $50

ຖ້າຫາກອ້າຍເອື້ອຍນ້ອງເຮົາ ຮູ້ຈັກບຸກຄົນ ຫຼື ເຈົ້າຂອງທຸລະກິດທີ່ ຕ້ອງການເງິນທືນໝູນວຽນ ກະລຸນາຊ່ວຍແຈ້ງຫາເຮົາແດ່ເດີ.

"ການຊ່ວຍເຫຼືອກັນ ຮ່ວມມືກັນ ເປັນວິທີທາງທີ່ຈະຢູ່ລອດໃນຍຸກ ກຳລັງພັດທະນາ"

-----------------------
☎ ສອບຖາມລາຍລະອຽດ ຄຳ ໂທ ຫຼືື WhatsApp: 020 99222886
') AS 'BODY',
	concat(current_staff,'_',name) AS 'custom_id'
FROM tabsme_Sales_partner
WHERE current_staff like '1003 - %' AND broker_type = '5way - 5ສາຍພົວພັນ'
	and sp.`rank` != 'Block - ຕ້ອງການໃຫ້ບຼ໋ອກ'
-- limit 10;






-- WA to SP sales partner for each Section https://docs.google.com/spreadsheets/d/1hPj0t15mY4OuGQjOPjDYVxQsbExgdq9AtJH3hjGdwNI/edit?gid=1078656354#gid=1078656354
SELECT         concat('856', right(sp.broker_tel , length(sp.broker_tel) - 2)) 'WHATSAPP',
CONCAT('ສະບາຍດີ ທ່ານລູກຄ້າ ', right(sp.broker_tel , length(sp.broker_tel) - 2) ,' ທີ່ຮັກແພງ',
'
ນ້ອງຊື່ ນິກ ເປັນພະນັກງານ ບໍລິສັດສິນເຊື່ອ ລາວອາຊຽນທີ່ເປັນອັນດັບ1ໃນປະເທດລາວ ເຊິ່ງໄດ້ຈົດທະບຽນຢູ່ຕະຫລາດຫລັກຊັບເເລ້ວ ຊືງບໍລິສັດເຮົາປ່ອຍເງີນກູ້ເງີນດ່ວນທັນໃຈຮັບຈຳທະບຽນລົດ ແລະ ນອກຈາກນີ້ທາງເຮົາຍັງ ຮັບສະມັກຜຸ້ທີຈະມາເປັນນາຍຫນ້າໃຫ້ບໍລິສັດເຮົາ ຖ້າມີໝູ່ຄູ່ຫຼືຄົນຮຸ້ຈັກທີສົນໃຈຈະກູ້ເງີນ ທ່ານ ສາມາດແນະນຳມາໃຫ້ພວກເຮົາໄດ້ ພວກເຮົາມີຄ່າຕອບແທນໃຫ້ສູງເຖີງ 3,5% ຂອງດອກເບ້ຍທັງໝົດ, ເເນະນຳມາເດີ້ ໄດ້ຄ່ານາຍຫນ້າຫລາຍ ບໍ່ຈຳກັດວົງເງິນນາຍຫນ້າ ຖ້າເເນະນຳມາ2ເທື່ອພາຍໃນເດືອນ ໄດ້+50$ ເເນະນຳມາເລີຍເດີ້ ເບີ 02078780230') 'BODY',
sp.name 'custom_id'
FROM tabsme_Sales_partner sp
left join tabsme_Employees emp on (sp.current_staff = emp.name)
left join sme_org org on (org.staff_no = emp.staff_no)
WHERE broker_type  = 
-- '5way - 5ສາຍພົວພັນ'
'SP - ນາຍໜ້າໃນອາດີດ'
-- 'X - ລູກຄ້າໃໝ່ ທີ່ສົນໃຈເປັນນາຍໜ້າ'
-- 'Y - ລູກຄ້າເກົ່າ ທີ່ສົນໃຈເປັນນາຍໜ້າ'
-- 'Z - ລູກຄ້າປັດຈຸບັນ ທີ່ສົນໃຈເປັນນາຍໜ້າ'
	and sp.`rank` != 'Block - ຕ້ອງການໃຫ້ບຼ໋ອກ'
AND org.sec_branch_no  = 2



-- WA to Resigned employees for each Section https://docs.google.com/spreadsheets/d/1hPj0t15mY4OuGQjOPjDYVxQsbExgdq9AtJH3hjGdwNI/edit?gid=1078656354#gid=1078656354
select concat('856', right(emp.main_contact , length(emp.main_contact) - 2)) `WHATSAPP`,
concat('ສະບາຍດີ ທ່ານລູກຄ້າ ', right(emp.main_contact , length(emp.main_contact) - 2) ,' ທີ່ຮັກແພງ',
'
ສະບາຍດີ ເອື້ອຍດ້າເດີ້ ເອື້ອຍຍັງເຮັດວຽກຢູ່ລາວອາຊຽນຄືເກົ່າເດີ້ ຖ້ານ້ອງມີລູກຄ້າທີ່ເຄີຍຕິດຕາມ ຫຼື ວ່າມີລູກຄ້າສົນໃຈສາມາດເເນະນຳລູກຄ້າມາໄດ້ເດີ້ ລູກຄ້າເກົ່າກໍໄດ້ຄ່ານາຍໜ້າຄືກັນ 1,75 %  ຂອງດອກເບ້ຍທັງໝົດ ເເລ້ວ ເເນະນຳມາເດີ້
' )
as `BODY`,
emp.name `custom_id`
from tabsme_Employees emp 
left join sme_org org on (org.staff_no = emp.assignee)
where emp.staff_status = 'Resigned'
	and org.sec_branch_no  = 1
;




-- Active SP send for Cashier
select -- count(sp.name) -- sp.name, tmsp.no_of_all_introduce
concat('856',SUBSTRING(sp.broker_tel, 3)) WHATSAPP,
CONCAT('ສະບາຍດີ! ທ່ານ ',SUBSTRING(sp.broker_tel, 2),' ທີ່ຮັກແພງ.
 
ພວກເຮົາຢາກຖືໂອກາດນີ້ ສະແດງຄວາມຂອບໃຈມາຍັງທ່ານອີກຄັ້ງສຳລັບລູກຄ້າທີ່ທ່ານໄດ້ແນະນຳໃຫ້ພວກເຮົາໃນອະດີດ, ມັນເປັນຄວາມຍິນດີທີ່ໄດ້ຮ່ວມງານກັນ ແລະ ຮ່ວມມືຕະຫຼອດມາ.

ພວກເຮົາສັງເກດວ່າຊ່ວງນີ້ ທ່ານຍັງບໍ່ໄດ້ມີການແນະນຳລູກຄ້າມາຫາເຮົາເທື່ອ, ແລະເຮົາຢາກຈະສອບຖາມວ່າມີຂໍ້ມູນຫຍັງທີ່ທ່ານຕ້ອງການເພີ່ມເຕີມບໍ ຫຼື ຍັງເງຶ່ອນໄຂໃດບໍຊັດເຈນ ທ່ານສາມາດໂທຫາ ຫຼື ແຊັດຫາໄດ້ເດີ ພວກເຮົາຍິນດີໃຫ້ຂໍ້ມູນທີ່ເປັນປະໂຫຍດ ເພື່ອໃຫ້ທານສາມາດແນະນຳຕໍ່ໃຫ້ລູກຄ້າໄດ້. 

ຂໍຂອບໃຈອີກຄັ້ງ, ພວກເຮົາກຳລັງລໍຖ້າຂ່າວດີຈາກທ່ານ, ຫວັງຢ່າງຍິ່ງວ່າພວກເຮົາຈະໄດ້ຮ່ວມງານກັນອີກຄັ້ງໜຶ່ງ ແລະ ຮ່ວມມືກັນຕະຫຼອດໄປ
'
) 
'BODY',
sp.name as 'custom_id'
from tabsme_Sales_partner sp
left join (select refer_id, count(*) as no_of_all_introduce from temp_sme_Sales_partner group by refer_id) tmsp on sp.refer_id = tmsp.refer_id
left join temp_sme_Sales_partner tmsp2 on tmsp2.contract_no = (select contract_no from temp_sme_Sales_partner where refer_id = sp.refer_id and date_format(creation, '%Y-%m') NOT between '2024-07' and '2024-09' order by creation desc limit 1)
left join sme_org sme on (case when locate(' ', sp.owner_staff) = 0 then sp.owner_staff else left(sp.owner_staff, locate(' ', sp.owner_staff)-1) end = sme.staff_no)
where sp.refer_type = 'LMS_Broker' and sp.`rank` != 'Block - ຕ້ອງການໃຫ້ບຼ໋ອກ'
	-- and sme.staff_no is not null 
	-- and tmsp.no_of_all_introduce < 5
	-- and tmsp.no_of_all_introduce >= 3
ORDER by tmsp.no_of_all_introduce DESC;





-- Resigned employees Send for HR
select concat('856', emp.main_contact ) `WHATSAPP`,
concat('ສະບາຍດີ ທ່ານ ', emp.main_contact  ,' ທີ່ຮັກແພງ',
'
ຂ້ອຍແມ່ນ ພະນັກງານ HR ເດີ. ຖ້າເອື້ອນຍອ້າຍມີລູກຄ້າທີ່ເຄີຍຕິດຕາມ ຫຼື ວ່າມີລູກຄ້າສົນໃຈສາມາດເເນະນຳລູກຄ້າມາໄດ້ເດີ້ ລູກຄ້າເກົ່າກໍໄດ້ຄ່ານາຍໜ້າຄືກັນ 1,75 %  ຂອງດອກເບ້ຍທັງໝົດ ເເລ້ວ ເເນະນຳມາເດີ້
ແລະ ມີເງຶ່ອນໄຂ ພິເສດຄື ຖ້າເປັນລູກຄ້າເກົ່າທີ່ເຄີຍຈ່າຍດີ ແມ່ນດອກເບັ້ຍຫຼຸດລົງເປັນ 1.99% ແລະ ຖ້າເປັນລູກຄ້າໃໝ່ ປິດງວດຢູ່ບໍລິສັດອື່ນແມ່ນ ດອກເບັ້ຍ 1.29% ເດີເຈົ້າ.
ຫຼື ຖ້າຢາກກັບມາເຮັດວຽກຄືນ ຫຼື ມີໝູ່ຄູ່ພີ່ນ້ອງທີ່ຢາກໃຫ້ມາເຮັດວຽກຢູ່ ລາໂກ້ແມ່ນສາມາດຕິດຕໍ່ມາໄດ້ເດີເຈົ້າ.
ຢາລືມໂທຫາເດີ')
as `BODY`,
emp.name `custom_id`
from tabsme_Employees emp 
left join sme_org org on (org.staff_no = emp.assignee)
where emp.staff_status = 'Resigned'
        -- and org.sec_branch_no  = 1




-- Dormant customer send for Credit
select concat('856', substring(apl.customer_tel, 3)) `WHATSAPP`,
concat('ສະບາຍດີ ',apl.customer_name ,' (', substring(apl.customer_tel, 3) ,') ທີ່ຮັກແພງ',
'

ຂ້ອຍແມ່ນ ຫົວໜ້າພະແນກ ອະນຸມັດ ທີ່ລາວອາຊຽນເຊົ່າສິນເຊື່ອ ທີ່ລູກຄ້າເຄີຍມາໃຊ້ບໍລິການຄັ້ງກ່ອນ.
ພວກເຮົາຕ້ອງຂໍອະໄພມານະທີ່ນີ້ດ້ວຍ ຫາກຄັ້ງກ່ອນທາງເຮົາໃຫ້ບໍລິການບໍທົ່ວເຖິງ ແລະ ພະນັກງານບໍລິການບໍສຸພາບ.

ຂໍ້ຄວາມສະບັບນີ້ເພື່ອຢາກຈະທາບທາມ ຖາມຂ່າວວ່າຊ່ວງນີ້ ທຸລະກິດລູກຄ້າເປັນຈັ່ງໃດ, ສະພາບຄ່ອງທາງການເງິນຍັງສະຖຽນຢູ່ບໍ? ມີຫຍັງທີ່ທາງເຮົາສາມາດຊ່ວຍລູກຄ້າໄດ້ອີກບໍ?
ແລະ ຢາກແຈ້ງໃຫ້ລູກຄ້າຊາບວ່າ ປະຈຸບັນພວກເຮົາກຳລັງຂະຫຍາຍສາຂາໃໝ່ຢູ່ຫຼາຍສາຂາ ເພື່ອໃກ້ ແລະ ສາມາດໃຫ້ບໍລິການລູກຄ້າໄດ້ທັນທີເມື່ອລູກຄ້າຕ້ອງການ ເຊິ່ງທາງເຮົາຍັງຮັກສາຂໍ້ມູນເກົ່າຂອງລູກຄ້າໄວ້ຢ່າງດີ ສາມາດປະກອບເອກະສານໃຫ້ໄດ້ພາຍໃນມື້ .
ນອກນັ້ນ, *ທາງເຮົາມີເງື່ອນໄຂພິເສດ* ມາສະເໜີສຳລັບລູກຄ້າເກົ່າຂອງພວກເຮົາທີ່ຈ່າຍດີໃນຄັ້ງກ່ອນຈະໄດ້ຮັບດອກເບ້ຍພິເສດ *1.99%* 
ແລະ ສຳລັບລົດໃໝ່ປີ 2024 ຮັບດອກເບ້ຍ 1.29%

ພິເສດ: ໃນກໍລະນີທີ່ທ່ານແນະນໍາລູກຄ້າມາໃຫ້, ເມື່ອເຮັດສັນຍາຮຽບຮ້ອຍແລ້ວ *ທ່ານຈະໄດ້ຄ່າຕອບແທນ3,5%* ຂອງດອກເບ້ຍທັງໝົດ

ທ່ານສາມາດປຶກສາ ແລະ ສອບຖາມລາຍລະອຽດທີ່: ກຸ້ງນາງ 020 54967888')
as `BODY`,
concat('Credit_',apl.name) `custom_id`
FROM tabSME_Approach_list apl
left join tabsme_Employees emp on (apl.staff_no = emp.name)
left join sme_org org on (emp.staff_no = org.staff_no)
WHERE approach_type = 'Dormant'
	-- and apl.usd_loan_amount >= 30000 -- 1st
	-- and apl.usd_loan_amount between 20000 and 29999 -- 2nd
	-- and apl.usd_loan_amount between 15000 and 19999 -- 3rd
	-- and apl.usd_loan_amount between 12500 and 14999 -- 4th
	-- and apl.usd_loan_amount between 11000 and 12499 -- 5th
	-- and apl.usd_loan_amount between 10000 and 10999 -- 6th
	-- and apl.usd_loan_amount between 8000 and 9999 -- 7th
	-- and apl.usd_loan_amount between 7000 and 7999 -- 8th
	and apl.usd_loan_amount between 6000 and 6999
ORDER BY apl.usd_loan_amount DESC





