

-- WA campaign for new 13 branches + 3 branches
SELECT 	concat('856', right(customer_tel, length(customer_tel) - 2)) 'WHATSAPP',
CONCAT('*ສະບາຍດີ, ລູກຄ້າທີ່ຮັກແພງ. ພວກເຮົາມີຂ່າວດີແຈ້ງໃຫ້ທ່ານຊາບ.*
ປະຈຸບັນນີ້ ບໍລິສັດ LALCO ຂອງພວກເຮົາໄດ້ຂະຫຍາຍສາຂາໃໝ່ 16 ສາຂາ ເພື່ອໃຫ້ໃກ້ບ້ານທ່ານ ໃຫ້ສາມາດບໍລິການລູກຄ້າໃຫ້ຄວບຄຸມແລະທົ່ວເຖິງໃນຂອບເຂດທົ່ວປະເທດ.

*ທ່ານເປັນຄົນໜຶ່ງທີ່ໂຊກດີຫຼາຍ ເມື່ອທ່ານໄດ້ຮັບຂໍ້ຄວາມນີ້.*
ພວກເຮົາ LALCO ເປີດໂອກາດໃຫ້ທ່ານສາມາດເຂົ້າຮ່ວມເປັນຄອບຄົວດຽວກັນກັບພວກເຮົາ ແລະ ໄດ້ຮັບຜົນປະໂຫຍດດັ່ງຕໍ່ໄປນີ້:
*(1)* ຖ້າທ່ານສົນໃຈເປັນ *[ ນາຍໜ້າ ]:* ເມື່ອທ່ານແນະນຳ ລູກຄ້າມາໃຫ້ພວກເຮົາ ທ່ານຈະໄດ້ຮັບເງິນໄປເລີຍ 3.5% ຂອງດອກເບ້ຍທັງໝົດ 
*ຕົວຢ່າງ:* ວົງເງິນກູ້ *10,000$* ທ່ານໄດ້ຮັບໄປເລີຍ *315$* ລາຍລະອຽດສາມາດສອບຖາມໄດ້ ສາຂາໃກ້ບ້ານທ່ານ ຫຼື ໂທປຶກສາຫົວໜ້າສາຂາໄດ້
*(2)* ຖ້າທ່ານສົນໃຈເປັນ *[ ລູກຄ້າ ]:* ທ່ານຈະໄດ້ເງິນໄປໃຊ້ຈ່າຍທັນທີ ແລະ ວົງເງິນບໍ່ຈຳກັັດອີກ ບໍລິການວ່ອງໄວ ແລະ ເຖິງທີ່, ເມື່ອທ່ານປຶກສາເງິນກູ້ກັບພວກເຮົາ
*(3)* ພວກເຮົາຍັງ *ເປີດຮັບພະນັກງານ* ການຕະຫຼາດຈຳນວນຫຼາຍ ທ່ານສາມາດ ແນະນຳຄົນຮູ້ຈັກ ຫຼື ພີ່ນ້ອງຂອງທ່ານ ເຂົ້າມາຍື່ນ CV ສາຂາໃກ້ບ້ານທ່ານໄດ້ ໃນໂມງການ

>> ສົນໃຈເປັນນາຍໜ້າ ຕອບ 1
>> ສົນໃຈຢາກກູ້ຢືມເງິນ ຕອບ 2
>> ສົນໃຈຢາກສະໝັກວຽກ ຕອບ 3

',
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໄຊທານີ (ນະຄອນຫຼວງ) (CAT : 020 54151519)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຫາດຊາຍຟອງ (ນະຄອນຫຼວງ) (KONG : 020 96295038)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ນາຊາຍທອງ (ນະຄອນຫຼວງ) (NY : 020 96737360)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືືອງ ປາກງື່ມ (ນະຄອນຫຼວງ) (FON-F : 020 77335449)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ນ້ຳບາກ (ແຂວງ ຫຼວງພະບາງ) (VATH : 020 94222206)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ປາກລາຍ (ແຂວງ ໄຊຍະບູລີ) (NOY-M : 020 97700889)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຄຳ (ແຂວງ ຊຽງຂວາງ) (PHUN : 020 59685564)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ໄຊສົມບູນ  (THA : 020 91559255)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ຜົ້ງສາລີ  (VANG : 020 91819635)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ສອງຄອນ (ແຂວງ ຈຳປາສັກ) (PINMANY : 020 92341779)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ວັງວຽງ (ແຂວງ ວຽງຈັນ) (HONG : 020 78163998)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຄຳເກີດ (ແຂວງ ບໍລິຄຳໄຊ) (LEE : 020 97299574)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ປາກຊອງ (ແຂວງ ຈຳປາສັກ) (KHAM : 020 54177087)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໂພນທອງ (ແຂວງ ຈຳປາສັກ) (PUNA : 020 99848359)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເຊກອງ  (LEY : 020 52222214)'
 '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໄຊເສດຖາ (ແຂວງ ອັດຕະປື) (LEUA : 020 54921285)'
) 'BODY' 
FROM tabSME_Approach_list tsal 
WHERE branch_name = 
-- 'Nam Bak - Luangprabang'
-- 'Sekong'
-- 'Parkngum - Vientiane Capital'
-- 'Hadxayfong - Vientiane Capital'
-- 'Naxaythong - Vientiane Capital'
-- 'Xaisomboun'
-- 'Vangvieng - Vientiane Province'
-- 'Xaythany - Vientiane Capital'
-- 'Kham - Xiengkhuang'
-- 'Phongsary'
-- 'Parklai - Xayaboury'
 'Saysetha - Attapeu'
-- 'Paksong - Champasack'
-- 'Khamkeut - Borikhamxay'
-- 'Songkhone - Savanakhet'
-- 'Phonthong - Champasack'--- ສົ່ງຂໍ້ຄວາມ ຫາ ເບີໂທໝ່ ຂອງ 13 ສາຂາໃໝ່



SELECT 	concat('856', right(customer_tel, length(customer_tel) - 2)) 'WHATSAPP',
CONCAT('*ສະບາຍດີ, ລູກຄ້າທີ່ຮັກແພງ. ພວກເຮົາມີຂ່າວດີແຈ້ງໃຫ້ທ່ານຊາບ.*
ປະຈຸບັນນີ້ ບໍລິສັດ LALCO ຂອງພວກເຮົາໄດ້ຂະຫຍາຍສາຂາໃໝ່ 16 ສາຂາ ເພື່ອໃຫ້ໃກ້ບ້ານທ່ານ ໃຫ້ສາມາດບໍລິການລູກຄ້າໃຫ້ຄວບຄຸມແລະທົ່ວເຖິງໃນຂອບເຂດທົ່ວປະເທດ.

*ທ່ານເປັນຄົນໜຶ່ງທີ່ໂຊກດີຫຼາຍ ເມື່ອທ່ານໄດ້ຮັບຂໍ້ຄວາມນີ້.*
ພວກເຮົາ LALCO ເປີດໂອກາດໃຫ້ທ່ານສາມາດເຂົ້າຮ່ວມເປັນຄອບຄົວດຽວກັນກັບພວກເຮົາ ແລະ ໄດ້ຮັບຜົນປະໂຫຍດດັ່ງຕໍ່ໄປນີ້:
*(1)* ຖ້າທ່ານສົນໃຈເປັນ *[ ນາຍໜ້າ ]:* ເມື່ອທ່ານແນະນຳ ລູກຄ້າມາໃຫ້ພວກເຮົາ ທ່ານຈະໄດ້ຮັບເງິນໄປເລີຍ 3.5% ຂອງດອກເບ້ຍທັງໝົດ 
*ຕົວຢ່າງ:* ວົງເງິນກູ້ *10,000$* ທ່ານໄດ້ຮັບໄປເລີຍ *315$* ລາຍລະອຽດສາມາດສອບຖາມໄດ້ ສາຂາໃກ້ບ້ານທ່ານ ຫຼື ໂທປຶກສາຫົວໜ້າສາຂາໄດ້
*(2)* ຖ້າທ່ານສົນໃຈເປັນ *[ ລູກຄ້າ ]:* ທ່ານຈະໄດ້ເງິນໄປໃຊ້ຈ່າຍທັນທີ ແລະ ວົງເງິນບໍ່ຈຳກັັດອີກ ບໍລິການວ່ອງໄວ ແລະ ເຖິງທີ່, ເມື່ອທ່ານປຶກສາເງິນກູ້ກັບພວກເຮົາ
*(3)* ພວກເຮົາຍັງ *ເປີດຮັບພະນັກງານ* ການຕະຫຼາດຈຳນວນຫຼາຍ ທ່ານສາມາດ ແນະນຳຄົນຮູ້ຈັກ ຫຼື ພີ່ນ້ອງຂອງທ່ານ ເຂົ້າມາຍື່ນ CV ສາຂາໃກ້ບ້ານທ່ານໄດ້ ໃນໂມງການ

>> ສົນໃຈເປັນນາຍໜ້າ ຕອບ 1
>> ສົນໃຈຢາກກູ້ຢືມເງິນ ຕອບ 2
>> ສົນໃຈຢາກສະໝັກວຽກ ຕອບ 3

',
 '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໄຊທານີ (ນະຄອນຫຼວງ) (CAT : 020 54151519)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຫາດຊາຍຟອງ (ນະຄອນຫຼວງ) (KONG : 020 96295038)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ນາຊາຍທອງ (ນະຄອນຫຼວງ) (NY : 020 96737360)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືືອງ ປາກງື່ມ (ນະຄອນຫຼວງ) (FON-F : 020 77335449)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ນ້ຳບາກ (ແຂວງ ຫຼວງພະບາງ) (VATH : 020 94222206)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ປາກລາຍ (ແຂວງ ໄຊຍະບູລີ) (NOY-M : 020 97700889)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຄຳ (ແຂວງ ຊຽງຂວາງ) (PHUN : 020 59685564)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ໄຊສົມບູນ  (THA : 020 91559255)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ຜົ້ງສາລີ  (VANG : 020 91819635)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ສອງຄອນ (ແຂວງ ຈຳປາສັກ) (PINMANY : 020 92341779)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ວັງວຽງ (ແຂວງ ວຽງຈັນ) (HONG : 020 78163998)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ຄຳເກີດ (ແຂວງ ບໍລິຄຳໄຊ) (LEE : 020 97299574)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ປາກຊອງ (ແຂວງ ຈຳປາສັກ) (KHAM : 020 54177087)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໂພນທອງ (ແຂວງ ຈຳປາສັກ) (PUNA : 020 99848359)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເຊກອງ  (LEY : 020 52222214)'
-- '*ຕິດຕໍ່ໄດ້ທີ່:* ຫົວໜ້າສາຂາ ເມືອງ ໄຊເສດຖາ (ແຂວງ ອັດຕະປື) (LEUA : 020 54921285)'
) 'BODY' 
FROM tabSME_Approach_list tsal 
WHERE approach_type = 'Approach list'
	and branch_name = 
-- 'Nam Bak - Luangprabang'
-- 'Sekong'
-- 'Parkngum - Vientiane Capital'
-- 'Hadxayfong - Vientiane Capital'
-- 'Naxaythong - Vientiane Capital'
-- 'Xaisomboun'
-- 'Vangvieng - Vientiane Province'
 'Xaythany - Vientiane Capital'
-- 'Kham - Xiengkhuang'
-- 'Phongsary'
-- 'Parklai - Xayaboury'
-- 'Saysetha - Attapeu'
-- 'Paksong - Champasack'
-- 'Khamkeut - Borikhamxay'
-- 'Songkhone - Savanakhet'
-- 'Phonthong - Champasack'--- ສົ່ງຂໍ້ຄວາມ ຫາ ເບີໂທໝ່ ຂອງ 13 ສາຂາໃໝ່
;





-- WA campaign for Past SABC over 1 year for IT team
SELECT 
    CONCAT('856', SUBSTRING(bp.customer_tel, 2)) AS `WHATSAPP`,
    'ສະບາຍດີ,
ຂໍໂທດທີ່ລົບກວນ!

ຂ້ອຍຊື່ ຄຳ, ເປັນພະນັກງານ ຂອງບໍລິສັດ LALCO, ເຊິ່ງເປັນບໍລິສັດຊັ້ນນໍາທີ່ສະເຫນີການແກ້ໄຂທາງດ້ານການເງິນທີ່ຍືດຫຍຸ່ນເພື່ອຕອບສະຫນອງຄວາມຕ້ອງການຂອງທຸກທ່ານ. ພວກເຮົາໃຫ້ທາງເລືອກປ່ອຍສິນເຊື່ອໂດຍບໍ່ຈຳກັດຈຳນວນເງິນກູ້ຢືມ, ເຮັດໃຫ້ມັນງ່າຍສໍາລັບທ່ານທີ່ຈະສະໜອງທຶນໃຫ້ກັບໂຄງການ ຫຼື ທຸລະກິດຂອງທ່ານ.

ນີ້ແມ່ນບາງຜົນປະໂຫຍດທີ່ສໍາຄັນໃນການບໍລິການຂອງພວກເຮົາ:
- ອັດຕາດອກເບ້ຍເລີ່ມຕົ້ນຕໍ່າສຸດ 1.29% ແລະສູງສຸດ 3% ຕໍ່ເດືອນ.
- ໄລຍະເວລາການກູ້ຢືມມີຕັ້ງແຕ່ 3 ຫາ 36 ເດືອນ, ເຫມາະສົມກັບຄວາມສະດວກສະບາຍຂອງທ່ານ.
ຖ້າຫາກທ່ານມີຄວາມສົນໃຈ ຢາກຮັບຮູ້ຂໍ້ມູນເພີ່ມເຕີມ ຫຼືມີຄໍາຖາມໃດໆ, ກະລຸນາຕິດຕໍ່ຫາໄດ້. ພວກເຮົາຢູ່ທີ່ນີ້ເພື່ອຊ່ວຍໃຫ້ທ່ານຕັດສິນໃຈທາງດ້ານການເງິນທີ່ດີທີ່ສຸດສໍາລັບທຸລະກິດ ຫຼືຄວາມຕ້ອງການສ່ວນບຸກຄົນຂອງທ່ານ.

ລໍຖ້າໃຫ້ການຊ່ວຍເຫຼືອທ່ານ!
ດ້ວຍຄວາມນັບຖືຢ່າງສູງ
ຄຳ ເບີໂທ 020 2930 1330' AS `BODY`, 
    tb.id AS `custom_id`
FROM 
    tabSME_BO_and_Plan AS bp
JOIN 
    temp_sme_pbx_BO AS tb ON bp.name = tb.id
WHERE 
    tb.type IN ('S', 'A', 'B', 'C') 
    AND tb.month_type > 12
LIMIT 2;




-- WA to Non-sales 5way 5 relationships
SELECT 
    CONCAT('856', RIGHT(broker_tel , LENGTH(broker_tel) - 2)) AS 'WHATSAPP',
    CONCAT('ສະບາຍດີ, ທ່ານລູກຄ້າ ',RIGHT(broker_tel , LENGTH(broker_tel) - 2),' ທີ່ຮັກແພງ!',
'
ຈາກ ຄຳ (ບໍລິສັດ ລາວອາຊຽນ ເຊົ່າສິນເຊື່ອ ມະຫາຊົນ) ເດີ,
ຊ່ວງນີ້ ອ້າຍ ເອື້ອຍນ້ອງ ເຮົາ ບໍຮູ້ຈັກຄົນຢາກໄດ້ເງິນທຶນໄປໝູນວຽນ ແດ່ບໍເຈົ້າ.
ເພາະ ທາງບໍລິສັດ ມີນະໂຍບາຍ ແລະ ເປົ້າໝາຍໃຫ້ຊອກລູກຄ້າໃໝ່ ພ້ອມກັບເງຶ່ອນໄຂ ພິເສດ ຄື
- ຮັບປິດງວດ ຢູ່ບໍລິສັດອື່ນ ດອກເບັ້ຍພຽງແຕ່ 1.29% ສຳລັບໄລຍະຍາວ ແລະ 1.99% ສຳລັບໄລຍະສັ້ນ
- ຫຼື ຖ້າເປັນລູກຄ້າເກົ່າ ທີ່ເຄີຍກູ້ຢືມຈາກ ບໍລິສັດແລ້ວ, ຈະຫຼຸດດອກເບັ້ຍໃຫ້ຄື ໄລຍະສັ້ນ ແມ່ນ 2.5% ແລະ ຈະຫຼຸດດອກເບັ້ຍຈົນເຖິງ 1.99% ສຳລັບໄລຍະຍາວ*
- ສຳລັບ ຄ່ານາຍໜ້າ ແມ່ນ ໃຫ້ 3.5% ຂອງດອກເບັ້ຍທັງໝົດ, ຖ້າແນະນຳລາຍທີ 2 ແມ່ນ ບວກເພີ່ມ $50
-----------------------
☎ ສອບຖາມລາຍລະອຽດໂທ: 020 99222886
WhatsApp: 020 99222886
') AS 'BODY',
	concat(current_staff,'_',name) AS 'custom_id'
FROM tabsme_Sales_partner
WHERE current_staff like '1003 - %' AND broker_type = '5way - 5ສາຍພົວພັນ'
-- limit 10;





















